<a href="https://colab.research.google.com/github/dubeyshubham786/Python_libraries/blob/main/Pandas_9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Cleaning Data - Casting Datatypes and Handling Missing Values

In [3]:
import pandas as pd
import numpy as np

In [14]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [15]:
df = pd.DataFrame(people)

In [16]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [17]:
# We can drop nan values by dropna function

df.dropna()

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [19]:
# This method uses this default arguement
# this will give the same output.

df.dropna(axis='index', how='any')

# The axis arguement can be set to either index or column
# It will drop nan values in a rows if it is set to index
# If we set it to columns then it will drop nan values from column if they have any.
# Here it will drop only those rows which have any missing values

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [20]:
# We can set it to how to all so that it will gives us rows where all values are not missing values.
# Here we have drop rows where we have all values as a missing values.
# If we set index to columns then also we get the same output
# Because we don't have any missing values in columns.

df.dropna(axis='index', how='all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [21]:
# If we want to drop only missing values from a particular rows 
# Let's say if there is missing values in email columns then we want to drop that row.
# If there is missing values in first, last and age columns then we have to keep those.
# For that we need to pass the subset arguement.

df.dropna(axis='index', how='all', subset=['email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [22]:
# We can also pass multiple values 
# like we need either last name or email address but we don't need both

df.dropna(axis='index', how='all', subset=['last', 'email'])

# As long as the last name and email is there it shouldn't drop those rows.

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [25]:
# We can see that there is a string of Missing values 
# We can replace this values by proper numpy NaN values 

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

# Here we have replace 'NA' and 'Missing' values as np.nan

In [26]:
df

# We can see that now we don't have any string with na or missing values

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [27]:
# We can also use isna method to find which are Nan values and which is not

df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [28]:
# Sometimes we have to fill NaN values with certain values
# For example fill all the NaN values with MISSING values

df.fillna('MISSING')

# It will make more sense with numerical data

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chris  Schafer                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING      Anonymous@email.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [31]:
# Now let's say we want average age but here we have string datatypes

df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [33]:
df['age'].mean()

TypeError: ignored

In [35]:
# we can do also get mean by assigning the age type as integer

df['age'] = df['age'].astype(int)

# It will work fine if there is no missing values in our dataframe
# It is causing error because NaN values is float

TypeError: ignored

In [36]:
type(np.nan)

float

In [38]:
# We can get our mean by converting missing values to zero
# But it is lot better to convert the age data to float

df['age'] = df['age'].astype(float)

In [40]:
# we can see the datatypes 

df.dtypes

# We can see that our age is a float object here

first     object
last      object
email     object
age      float64
dtype: object

In [42]:
# So now we can take average 

df['age'].mean()

46.75

In [42]:
# If you have an entire dataframe of numbers and something like that then
# We can also use astype like this df.astype() 
# And pass the columns values in it but we have a mix columns here so we won't do that.

## Now let's see on imdb dataset

In [2]:
from google.colab import drive
drive.mount('/content/gdrive/')

Mounted at /content/gdrive/

In [43]:
df = pd.read_csv('/content/gdrive/MyDrive/Colab Notebooks/Github/Pandas/imdb_data.csv')

In [50]:
df.head(2)

   id  ...   revenue
0   1  ...  12314651
1   2  ...  95149435

[2 rows x 23 columns]

In [57]:
df['runtime'].mean()

107.85657104736491

In [59]:
type('release_date')

str